"mx_app_name" = "Smart Plus";
"mx_role_hand_over" = "Transfer Home Ownership";
"mx_invite_code_clipboard" = "Invitation code: %@\n [%@] invites you to join [%@]. Please log in the [%@] app, go to \"My - Family Management - Join Family\”. Enter the invitation code to join. The invitation code is valid for 1 day.";
"mx_invite_phone_des" = "If the invitation is sent successfully, please notify the other party to log in the \"%@\" APP and agree to the invitation.";
"mx_join_family_scan_use" = "Please use the \"%@\" APP\nClick the \"+\" button in the upper right corner of the home page to scan the QR code";
"mx_share" = "Share";
"mx_notifications" = "Inbox";
"mx_other_login" = "Your account has been logged in on another device. Please try again";
"mx_re_login" = "Login again";
"mx_no_input" = "Input is empty";
"mx_album" = "Album";
"mx_scan" = "Scan";
"mx_confirm" = "Confirm";
"mx_cancel" = "Cancel";
"mx_scan_des" = "Please scan the QR code";
"mx_home" = "Home";
"mx_devices" = "Devices";
"mx_smart" = "Smart";
"mx_quick_login" = "Login";
"mx_new_version" = "New version";
"ccs_del_device_title" = "Are you sure to remove the device?";
"ccs_del_device_des" = "After the device is removed, it will not be displayed on the IVI. You can add it again";
"ccs_group_show" = "Groups displayed on the IVI";
"ccs_group_hide" = "Groups not displayed on the IVI";
"ccs_scene_show" = "Scenes displayed on the IVI";
"ccs_scene_hide" = "Scenes not displayed on the IVI";
"ccs_device_show" = "Devices displayed on the IVI";
"ccs_device_hide" = "Devices not displayed on the IVI";
"mx_phone_code_success" = "Succeed";
"mx_tips" = "Tips";
"mx_minute" = "m";
"mx_second" = "s";
"mx_unbind_user_des" = "Are you sure to unbind the user?";
"mx_share_user" = "Add Shared Member";
"mx_del_msg_title" = "Delete this Message?";
"mx_del_msg_des" = "The selected message will be cleared after confirmation";
"mx_input_nickname" = "Nickname";
"mx_take_photo" = "Take Photo";
"mx_set_nickname" = "Set Nickname";
"mx_set_photo" = "Upload Photo";
"mx_disagree_quit" = "Quit";
"mx_exit" = "Exit";
"mx_agree" = "Agree";
"mx_exit_not_saved" = "Not saved. Comfirm to exit?";
"mx_saved_exit" = "Save and Exit";
"mx_no_update" = "No new version";
"mx_on" = "on";
"mx_off" = "off";
"mx_account_del" = "Cancel Account";
"mx_account_del_confirm" = "Cancel Account";
"mx_account_del_title" = "All data is unrecoverable after Account Cancellation. Confirm it?";
"mx_account_del_des" = "After you cancel your account, your personal information, such as phone number and email address, will be deleted.\n\n In addition, all devices bound to the account will be unavailable.\n\n The above operation is irreversible, if you still want to cancel your account, please click next.";
"mx_dark_mode" = "Dark Mode";
"mx_normal_mode" = "Light Mode";
"mx_change_password" = "Change Password";
"mx_change_lanuage" = "Language";
"mx_system" = "Automatic";
"mx_system_mode_des" = "When turned on, it will follow the system to turn dark mode on or off.";
"mx_account_location" = "Location";
"mx_user_photo" = "Profile Photo";
"mx_user_account" = "Account";
"mx_user_nickname" = "Nickname";
"mx_OTA" = "Firmware Update";
"mx_firmware_version" = "Firmware Version";
"mx_mcu_version" = "MCU Version";
"mx_more_service" = "More Services";
"mx_about" = "About Us";
"mx_setting" = "Settings";
"mx_experience" = "Experience";
"mx_message_center" = "Inbox";
"mx_faq" = "FAQ";
"mx_profile_edit" = "View and set Profile";
"mx_device_share" = "Device Sharing";
"mx_home_manager" = "Home Manage";
"mx_manually_choose" = "Manually select";
"mx_save" = "Save";
"mx_issue_type" = "Functional Suggestions";
"mx_device_issue" = "Device Issue";
"mx_app_issue" = "APP Issue";
"mx_gateway_issue" = "Gateway Issue";
"mx_other_issue" = "Others";
"mx_no_data" = "No data";
"mx_next" = "Next";
"mx_shared_device" = "Shared Devices";
"mx_my_device" = "My Device";
"mx_select" = "Select";
"mx_logout" = "Logout";
"mx_account_phone_hint" = "Phone";
"mx_account_email_hint" = "Email";
"mx_account_phone_invalid" = "Mobile number format error";
"mx_account_email_invalid" = "Email format error";
"mx_submit" = "Submit";
"mx_profile_info" = "Personal info.";
"mx_version_check" = "Check for Updates";
"mx_user_agreement" = "User Agreement";
"mx_privacy_policy" = "Privacy Policy";
"mx_message_setting" = "Settings";
"mx_notificaiton_on" = "Enable notification";
"mx_selected_all" = "Select All";
"mx_delete" = "Delete";
"mx_disagree" = "Disagree";
"mx_other_voice" = "Third party voice services";
"mx_other_voice_des" = "Access to third-party voice speaker control";
"mx_replace" = "Device Replacement";
"mx_replace_des" = "Replace the faulty equipment with Device Replacement and synchronize the settings";
"mx_replaced_device" = "Replaced device";
"mx_replace_device" = "Replace";
"mx_replace_new_device" = "New device";
"mx_replace_ready" = "Ready";
"mx_replace_doing" = "Executing";
"mx_replace_alert_title" = "Do you want to replace this device?";
"mx_replace_alert_des" = "After being replaced, all settings of this device will be synchronized to the new device, and this device will be unbound";
"mx_replace_cancel_des" = "Synchronization not completed, do you want to cancel setting? Setting will be interrupted after cancellation";
"mx_done" = "Done";
"mx_back" = "Back";
"mx_feedback" = "Feedback";
"mx_feedback_type" = "Type of Issue";
"mx_feedback_record" = "Records";
"mx_feedback_app" = "APP feedback";
"mx_feedback_input_title" = "Fill in the feedback info.";
"mx_feedback_input_des" = "Please describe the problem in detail and we will reply you as soon as possible.";
"mx_feedback_photo_des" = "Upload pictures (optional, up to 5)";
"mx_feedback_provision" = "Networking problems";
"mx_feedback_my" = "My feedback";
"mx_feedback_submit_time" = "Submit time";
"mx_submit_success" = "Successfully";
"mx_send" = "Send";
"mx_sync" = "Sync";
"mx_choose_sync_room_desc" = "Total:%d unsynchronized:%d";
"mx_scene_sync" = "Sync data";
"mx_matter_sync" = "Matter synchronize";
"mx_matter_des" = "Synchronize the Matter protocol so that the device  can support Matter protocol control";
"mx_matter_gateway_title" = "synchronized gateway";
"mx_matter_selected_gateway" = "Select a gateway";
"mx_matter_faq" = "1. If you want to use the Matter protocol to control devices, you must first add Matter gateway support in your network;\n2. One or more Matter gateways have been added to the network, you need to set in My -> More Services -> Matter Synchronization Select a gateway in , and synchronize the device information to the gateway, so that the device supports Matter protocol control;\n3, please turn on Bluetooth during the synchronization process, and keep the mobile phone as close as possible to the gateway, so as to facilitate the Bluetooth connection to the corresponding gateway to synchronize device information;\n4, only support Only devices with Matter protocol can be synchronized;";
"mx_matter_expl" = "The following devices support the Matter protocol. If you have added a Matter gateway, select the device to synchronize and support Matter control.";
"mx_matter_no_device" = "There are currently no devices that support Matter\nplease add first";
"mx_matter_no_gateway" = "Matter gateway not added";
"mx_matter_unbound_gateway" = "No found gateway";
"mx_sync_success" = "Synchronization succeeded";
"mx_share_success" = "Succeed";
"mx_update_success" = "Succeed";
"mx_share_no_selected_device" = "No selected device";
"mx_del_success" = "Succeed";
"mx_ota_cancel_des" = "Cancel the upgrade? After canceling, you can continue the upgrade next time";
"mx_add_room" = "Add Room";
"mx_del_room_title" = "Delete this Room？";
"mx_input_room_name" = "Enter Room Name";
"mx_del_room_des" = "After deletion, devices in this room will be removed to the default room.";
"mx_send_success" = "Succeed";
"mx_send_fail" = "Failed";
"mx_invite_code_title" = "Invitation Code";
"mx_invite_code" = "Invitation code: %@\nCopy the invitation code and send it to the invitee";
"mx_i_know" = "Got it";
"mx_copy" = "Copy";
"mx_upgrade" = "Update";
"mx_upgrade_tips" = "Tips";
"mx_upgrade_failed" = "Fail to update";
"mx_upgrade_version_log" = "Log:";
"mx_upgrade_app" = "The current APP version is too early. Please update to the latest version";
"mx_ota_progress" = "Progress";
"mx_note" = "Notes";
"mx_note_des" = "1.  Please turn on your cell  phone's Bluetooth during the update process\n2. Please make sure that your  cell phone's Wi-Fi network is stable during the update process \n3. Please  make sure that your device is online \n4. Please keep your cell phone as close  to the device as possible";
"mx_connect_failed_title" = "Fail to connect";
"mx_connect_failed_des" = "Please turn on your phone's  Bluetooth, and keep your phone as close to the device as possible.";
"mx_upgrading" = "Updating…";
"mx_retry" = "Retry";
"mx_ota_device_tips" = "The firmware version of the device is too early. Please update to the latest version";
"mx_recall" = "Undo";
"mx_name" = "name";
"mx_role" = "Family Role";
"mx_role_owner" = "Home Owner";
"mx_role_admin" = "Administrator";
"mx_role_user" = "Common Member";
"mx_role_select" = "Family Role";
"mx_role_admin_des" = "Device Manage | Home Manage | Smart Manage";
"mx_role_user_des" = "Control Device | Use Smart";
"mx_role_del_member" = "Remove Member";
"mx_role_del_member_title" = "Remove family member？";
"mx_role_del_member_des" = "After removal, the member will not be able to operate devices and smart in the home";
"mx_role_owner_fun_des" = "This feature can only be operated by the \"Home Owner\".";
"mx_role_user_fun_des" = "This operation is not available to \"Common Members\", please contact \"Family Owner\" to enable the permission in \"Family Settings\".";
"mx_room_move_to_room" = "Move to this Room?";
"mx_room_device_out" = "Device not in this room";
"mx_set_name_title" = "Name Setting";
"mx_no_set" = "Not set";
"mx_device_number" = "Devices";
"mx_device_manage" = "Device Manage";
"mx_device_list" = "Devices";
"mx_room_setting" = "Room setting";
"mx_room_wrapper" = "Room wallpaper";
"mx_room_name" = "Room Name";
"mx_room_recommend" = "Recommended Name";
"mx_group" = "Group";
"mx_invite_member" = "Add Member";
"mx_invite_code_member" = "Invitation code";
"mx_invite_account_member" = "Invite by account";
"mx_invite_qrcode_member" = "Scan QR code";
"mx_invite_waiting" = "Waiting for approval";
"mx_invite" = "Invite";
"mx_scan_qrcode" = "Scan QR code";
"mx_invite_type" = "Select a method";
"mx_invite_code_input" = "Invitation code";
"mx_room" = "Rooms";
"mx_member" = "Members";
"mx_join_family" = "Join a family";
"mx_family_name" = "Home Name";
"mx_family_member" = "Home Members";
"mx_family_setting" = "Home Setting";
"mx_family_location" = "Home Location";
"mx_role_hand_over_to" = "Hand over to";
"mx_role_hand_over_title" = "Are you sure to hand over Home?";
"mx_role_hand_over_des" = "Hand over to \"%@\"，you will not be the Owner";
"mx_role_hand_over_tips" = "Please pay attention! \nAfter handing over the family, you will no longer be the owner of the family; \n Such operation is irreversible!";
"mx_role_no_member" = "There are no available members, please invite members first!";
"mx_input_code" = "Verification Code";
"mx_resend_code" = "Resend";
"mx_del_device" = "Delete";
"mx_del_share_device_des" = "Delete this device?";
"mx_del_device_des" = "Delete selected device? The settings associated with the device will be invalidated when the device is deleted.";
"mx_del_device_batch_des" = "Delete  the device/scene? After deletion, the settings related to the device will be invalidated";
"mx_edit" = "Edit";
"mx_room_manage" = "Room Manage";
"mx_search_location" = "Search location";
"mx_invite_code_input_admin" = "Enter the invitation code";
"mx_select_room" = "Choose the room";
"mx_refresh" = "Refresh";
"mx_join_family_scan" = "Scan QR code";
"mx_join_family_des" = "Add home to use devices, smart func.";
"mx_join_family_qrcode_exp" = "Valid for 5 minutes";
"mx_set_favorite" = "Hidden";
"mx_input_name" = "Enter name";
"mx_device_name" = "Device Name";
"mx_role_member_permission" = "Family Member Access";
"mx_scene_no" = "No Scene";
"mx_scene_list" = "Scenes";
"mx_group_list" = "Groups";
"mx_create_family" = "Create Home";
"mx_set_location" = "Tap to get weather";
"mx_add_device" = "Add Device";
"mx_add_group" = "Create Group";
"mx_join_group" = "Add";
"mx_remove_group" = "Remove";
"mx_group_manage" = "Group Manage";
"mx_add_smart" = "Add Smart";
"mx_smart_manager" = "Smart Manage";
"mx_provision_auto" = "Auto-Find";
"mx_provision_manual" = "Manually";
"mx_provision_select_all" = "Select";
"mx_provision_search_prepare" = "Ready to search...";
"mx_provision_searching" = "Searching for devices...";
"mx_provision_ensure_device_state" = "Please make sure that the device is in networking mode";
"mx_permission_location_denied" = "Location Permissions not authorized";
"mx_permission_location_denied_des" = "To quickly locate, please enable location services";
"mx_ble_not_auth_text" = "Bluetooth related permissions are abnormal, please click to check authorization";
"mx_permission_ble_switch" = "Please enable Bluetooth Services";
"mx_select_device" = "Select Device";
"mx_select_device_hint" = "Please select a device";
"mx_provisioning_des" = "%d devices being added, %d device have done";
"mx_add_success" = "Successfully adding";
"mx_add_failed" = "Fail to add";
"mx_resume_add" = "Continue to add";
"mx_offline" = "offline";
"mx_set_network" = "Network Settings";
"mx_provision_wifi_limit_tips" = "Only 2.4 Wi-Fi Network is supported";
"mx_init_device" = "Reset device";
"mx_connect_wifi" = "Establish Wi-Fi Connection";
"mx_provision_status_incorrect" = "Device status error?";
"mx_provision_status_correct" = "Make sure the indicator is blinking";
"mx_skip" = "Skip";
"mx_skip_set" = "If your gateway is connected to Ethernet, you can skip the settings";
"mx_skip_set_wifi_des" = "Whether to skip the setting of network. After the skipping, Bluetooth binding will be performed. You can set the network connection again in the device panel in the future.";
"mx_room_no_set" = "Unassigned";
"mx_family_del_des" = "All members are deleted, data is erased, and added devices are unbound and reset";
"mx_my_family" = "My Home";
"mx_device_detail" = "Device Details";
"mx_group_detail" = "Group Details";
"mx_room_location" = "Room";
"mx_device_id" = "Device ID";
"mx_added_time" = "Bound Time";
"mx_shared_time" = "Shared Time";
"mx_created_time" = "Created Time";
"mx_group_name" = "Group Name";
"mx_dissolve_group" = "Delete";
"mx_dissolve_group_tips" = "Delete this Group？";
"mx_save_failed" = "Fail to save";
"mx_go_setting" = "Set";
"mx_provision_back_des" = "Device being added,Cancel it or not?";
"mx_failed_detail" = "Failure detail";
"mx_ble_connect_failed" = "Bluetooth connection failure with device";
"mx_mesh_config_failed" = "Failed to configure Bluetooth MESH network";
"mx_setting_wifi_failed" = "Failed to connect to Wi Fi network";
"mx_sync_fail" = "Synchronization failed";
"mx_account_bind_fail" = "Binding account failed";
"mx_provision_connect_fail" = "Check the following possible reasons: \n 1. Whether the device is powered off; \n 2. Is the device too far away from the phone;";
"mx_provision_config_fail" = " Check the following possible reasons: \n 1. Whether the device is powered off; \n 2. Is the device too far away from the phone;";
"mx_provision_wifi_fail" = " Check for possible reasons: \n 1. Incorrect WiFi and password entered; \n 2. WiFi network is not 2.4G;";
"mx_provision_bind_fail" = " Check for the following possible reasons: \n 1. Whether the network is unobstructed;";
"mx_scene_select" = "Select Scene";
"mx_will_add" = "To be added";
"mx_search_history" = "Search History";
"mx_search_result" = "The search results";
"mx_search_no_result" = "No Search result";
"mx_search_input_hint" = "Device Name";
"mx_search_history_clear" = "Delete the history？";
"mx_account_unregistered" = "The current account is not registered. Register this account first?";
"mx_scene" = "Scene";
"mx_scene_reset_des" = "Reset the setting？\n Reset the setting？The reset will clear the original Settings";
"mx_room_permission" = "Room Permission";
"mx_set_group" = "Set up group";
"mx_edit_group" = "Edit Group";
"mx_edit_device" = "Add/Remove Device";
"mx_tasks_added" = "Devices added to the task";
"mx_rename" = "Rename";
"mx_account_not_exist" = "Account not found, please check if it is correct";
"mx_reset" = "Reset";
"mx_clean_setting_fail" = "Clean up Fail";
"mx_selected_device_num" = "%d devices selected";
"mx_selected_scene_num" = "%d scenes selected";
"mx_device_set_room_fail" = "Failed to set up room on some devices";
"mx_do" = "Execute";
"mx_logout_alert_des" = "Logout?";
"mx_select_country_code" = "Select Region";
"mx_select_country_code_hint" = "Please select region first";
"mx_password_hint" = "Password";
"mx_code_login" = "Verification Code Login";
"mx_send_code" = "Get Verification Code";
"mx_password_login" = "Password Login";
"mx_forget_password" = "Forgot Password";
"mx_wifi_change" = "Change Wi-Fi";
"mx_wifi_change_fail" = "Failed to change Wi-Fi";
"mx_wifi_change_success" = "Replace Wi-Fi successfully";
"mx_set_password" = "Set Password";
"mx_third_login" = "Other Login";
"mx_read_policy_first" = "Please read and agree to the User Agreement and Privacy Policy";
"mx_faq_detail_title" = "Detail of the issue";
"mx_found_device" = "Found Device";
"mx_wifi_ssid_hint" = "Choose your Wi-Fi network";
"mx_wifi_ssid_error" = "it may be a 5GHz Wi-Fi. Please select a 2.4GHz Wi-Fi.";
"mx_wifi_password_hint" = "Enter password";
"mx_home_switch_des" = "You have joined a new family. Do you want to switch to the new family?";
"mx_opened" = "On";
"mx_closed" = "Off";
"mx_home_guide_desc" = "Home Manage, all devices are in \"My Home\"; Click %@ to change the home name.";
"mx_home_guide_room_desc" = "You can choose the room in the home according to your needs, or you can set it in the Home Manage.";
"mx_scene_manual_create" = "Create Scene";
"mx_scene_manual_edit" = "Edit Scene";
"mx_scene_icon_style" = "Icon";
"mx_scene_eg_device" = "When device status changes";
"mx_scene_eg_device_des" = "eg: When open the door";
"mx_scene_eg_time" = "Schedule";
"mx_scene_eg_time_des" = "eg: Every morning at 9 o 'clock";
"mx_scene_auto_create" = "Create Auto Scene";
"mx_scene_auto_edit" = "Edit Auto Scene";
"mx_create" = "Create";
"mx_if" = "If";
"mx_color" = "Color";
"mx_icon" = "Icon";
"mx_scene_device_action" = "Execute the following tasks";
"mx_scene_time_valid_interval" = "Effective Period";
"mx_all_day" = "All Day";
"mx_start" = "Start";
"mx_end" = "End";
"mx_repeat_mode" = "Repeat";
"mx_execute_once" = "Only Once";
"mx_every_day" = "Everyday";
"mx_workday" = "Every Weekdays";
"mx_weekend" = "Every Weekends";
"mx_custom" = "Custom";
"mx_set_name" = "Set Name";
"mx_del_auto" = "Delete Auto Scene";
"mx_del_scene" = "Delete Scene";
"mx_del_scene_des" = "Delete this？";
"mx_del_scene_confirm" = "Delete this？";
"mx_scene_condition_select" = "Select Condition";
"mx_scene_action_select" = "Select Task";
"mx_send_notification" = "Send Notification";
"mx_multiple_conditions" = "Has Several Conditions";
"mx_scene_trigger_title_or" = "If";
"mx_scene_trigger_add" = "Add Trigger";
"mx_scene_condition_add" = "Add Condition";
"mx_scene_action_add" = "Add Task";
"mx_scene_send_notification_des" = "eg: Send a notification";
"mx_scene_condition_title_and" = "And when all conditions are met";
"mx_scene_condition_title_or" = "And when any condition is met";
"mx_scene_condition_logic_and" = "When all conditions are met";
"mx_scene_condition_logic_or" = "When any condition is met";
"mx_input_message_hint" = "Please enter…";
"mx_scene_time" = "Timer";
"mx_scene_logic_or" = "or";
"mx_selected_category" = "Select Category";
"mx_scene_no_condition" = "Condition cannot be empty";
"mx_scene_no_action" = "task cannot be empty";
"mx_scene_manual" = "Scene";
"mx_scene_manual_manager" = "Scene Manage";
"mx_scene_auto_manager" = "Auto Scene Manage";
"mx_scene_manual_action_below" = "Execute the following tasks";
"mx_ok" = "OK";
"mx_syncing" = "Syncing";
"mx_scene_action_invalid" = "Some of the tasks in this scene are no longer valid, and you can delete the invalid tasks";
"mx_scene_action_invalid_save" = "Some of the tasks in this scene are no longer valid, saving will remove the expired tasks";
"mx_scene_local_condition_invalid" = "The triggering device for this scene is unbound and the condition is not working. Delete it?";
"mx_no_device" = "No device";
"mx_brightness" = "Brightness";
"mx_saturation" = "Saturation";
"mx_help" = "Help";
"mx_my_scene" = "My Smart";
"mx_scene_recommend" = "Discover";
"mx_scene_auto" = "Auto Scene";
"mx_scene_manual_des" = "eg: Click on the scene card to execute the viewing mode";
"mx_scene_switch_device_batch" = "Turn on/off devices";
"mx_scene_switch_device_batch_des" = "eg: Turn on all the lights in the living room";
"mx_scene_action_delay" = "Delay The Task";
"mx_scene_action_delay_des" = "eg: Execute the next task after 1 minute";
"mx_scene_control_device" = "Control Device";
"mx_scene_control_device_des" = "eg: Turn on the switch of living room";
"mx_scene_light" = "Set lights by template";
"mx_scene_light_des" = "eg: Click to adjust the lighting effect of the home";
"mx_scene_switch_auto" = "Turn on/off auto scene";
"mx_scene_switch_auto_des" = "eg: Open an auto scene that has been created";
"mx_scene_light_effect_set" = "Set Light Effects";
"mx_scene_light_effect_not" = "No lighting effects set";
"mx_scene_light_common" = "Common Mode";
"mx_scene_light_template_manager" = "Template Manage";
"mx_selected_template_hint" = "Please select a light template";
"mx_scene_light_template_list" = "Template List(Click to select the template to use)";
"mx_scene_light_template_create" = "Add New";
"mx_scene_status" = "Scene Status";
"mx_scene_unsync" = "Unsynced scenes";
"mx_scene_invalid" = "Invalid Scenes";
"mx_timing" = "Timer";
"mx_invalid" = "Invalid";
"mx_not_found_device" = "Not found";
"mx_ble" = "Bluetooth";
"mx_disconnect" = "Disconnected";
"mx_sync_unconnect_title" = "Bluetooth Disconnect";
"mx_ble_disconnect_device" = "Fail to connect device by bluetooth";
"mx_ble_disconnect_des" = "If you do not add a gateway, the APP needs to connect to the MESH device through Bluetooth to control the devices in the local MESH network";
"mx_scene_expired_num" = "%d scenes are invalid";
"mx_scene_unsync_num" = "%d scenes unsynced";
"mx_scene_action_manual_des" = "eg: Execute the created scene";
"mx_less" = "less than";
"mx_equal" = "equal to";
"mx_greater" = "greater than";
"mx_time_delay" = "delay time";
"mx_connect_status" = "Connection Status";
"mx_network_state_wifi" = "Wi-Fi Connection";
"mx_connect_net" = "Ethernet Connection";
"mx_ble_disconnect" = "Bluetooth Disconnected";
"mx_recovery" = "Data Recovery";
"mx_recovery_des" = "Backup or restore the whole house scene or related settings";
"mx_recovery_no_data" = "No device to recover";
"mx_recover_restart" = "Restart";
"mx_recover_replay" = "Continue to recover";
"mx_recovery_tips_title" = "If you are provided with an installation service by a service provider that has a backup of the initial state, Recovery can restore the device to the initial state, and the following devices can be restored to the backup:";
"mx_recovery_tips_des" = "One-Click Recovery needs to synchronize data by connecting device locally via Bluetooth Mesh. Please keep your phone's bluetooth on during execution and stay as close to the device as possible";
"mx_scene_more" = "More Scenes";
"mx_bind_scene_des" = "You can select up to %d scenes to associate with a button, and when the button is clicked, the scenes will be executed in a cyclic order";
"mx_scene_bind_title" = "Bound Scenes";
"mx_scene_unbind_title" = "Unbound Scenes";
"mx_bind_scene_max" = "Associate up to %d scenes";
"mx_add_room_all" = "Add all to the room:";
"mx_sync_unconnect_des" = "The settings have been saved to the cloud, but have not been synchronized to the device. Local auto scene is not  valid. Do you want to connect Bluetooth to continue synchronizing the settings?";
"mx_light_photo_color" = "Get color in photos";
"mx_select_color" = "Choose a color";
"mx_light_udp_disconnect" = "The device has not been successfully connected yet. Please try again later. Please ensure that your phone and light are connected to the same Wi-Fi network";
"mx_light_follow" = "Follow the light";
"mx_light_follow_des" = "Click the button, and the device will change color in real time according to the screen";
"mx_light_follow_stop" = "Click to stop following the light";
"mx_device_no_support" = "No device support this feature";
"mx_execute_time" = "execution time";
"mx_open_now" = "Open Now";
"mx_bind_account" = "Bind account";
"mx_scene_light_scene" = "Light Scene";
"mx_scene_light_custom" = "Custom Action";
"mx_name_duplicate" = "Name already exists";
"mx_delay_value_des" = "After %d seconds";
"mx_name_invalid" = "Only supports 1-%d characters";
"mx_create_successfully" = "Created successfully";
"mx_whole_house" = "Home";
"mx_all" = "All";
"mx_network_error" = "Network error";
"mx_gateway_password_invalid" = "Only supports uppercase and lowercase letters, numbers, and English punctuation with a length of 6-32 bits";
"mx_set_gateway_password_success" = "Password set successfully";
"mx_set_gateway_password_fail" = "Fail to set password";
"mx_has_password" = "HAS Access Password";
"mx_gateway_ip" = "IP";
"mx_scene_more_setting" = "More Settings";
"mx_scene_method" = "Execution Method";
"mx_scene_auto_set_name" = "Name the auto scene";
"mx_scene_oneclick_set_name" = "Name the scene";
"mx_scene_action_unrecognized" = "Unrecognizable";
"mx_ota_list_no_update" = "All new releases";
"mx_ota_list_header" = "New Version To be Updated";
"mx_share_no_message" = "No Messages";
"mx_lanuage_zh" = "简体中文";
"mx_lanuage_en" = "English";
"mx_replace_selected_device" = "Select Device";
"mx_replace_cancel_title" = "Cancel?";
"mx_defalut_room" = "My Room";
"mx_feedback_falut" = "Feedback Failure";
"mx_feedback_issue" = "Functional Suggestions";
"mx_feedback_reply_des" = "Input content";
"mx_device_owner" = "'s device";
"mx_ota_wifi_back_des" = "Upgrading is in progress, please do not exit the page!";
"mx_copy_success" = "Copied";
"mx_group_no_device_des" = "The group has no devices, delete it?";
"mx_ota_step_download" = "Download Firmware";
"mx_ota_step_trans" = "Firmware Transmission";
"mx_ota_step_finish" = "Upgrade completed";
"mx_ota_step_upgrad" = "Device Upgrade";
"mx_ota_download_fail" = "Fail to download firmware";
"mx_ota_step_connect" = "Connect Device";
"mx_upgrade_success" = "OTA successful";
"mx_set_room_fail" = "Failed to set up room";
"mx_ota_version" = "Version";
"mx_device_unbind_des" = "The device has been unbound";
"mx_family_exit_des" = "Sure to exit the home?";
"mx_family_del_title" = "Sure to delete the home?";
"ccs_no_group" = "No Groups";
"mx_scene_add" = "Add Scene";
"mx_location_auth_des" = "Please allow \"%@\" to use location services to add devices quickly!";
"mx_provisioning_step_config" = "Set up BLE MESH network";
"mx_provisioning_step_connect_wifi" = "Connect Wi-Fi Network";
"mx_provisioning_step_connect_ble" = "Connect device by bluetooth";
"mx_provisioning_step_bind" = "Bind Account";
"mx_provisioning_set_network" = "Set up Network";
"mx_init_device_des" = "Long press reset button for 5 seconds, the indicator flashes.";
"mx_try_to" = "Please try to";
"mx_provision_result_tips" = "The device that has been added successfully has been bound to your account. You can find the device on the home page. If the device fails to be added, please check the reason and enter the networking mode again to continue adding the device.";
"mx_provision_step_detail" = "Here are the detailed steps to add a device";
"mx_add_device_title" = "Devices being added";
"mx_add_device_des" = "Please keep your phone, device and router as close as possible to ensure that the mobile network is stable";
"mx_group_update_fail" = "Fail to update";
"mx_group_name_input_hint" = "Enter a group name";
"mx_group_create_fail" = "Failed to create group";
"mx_group_deleted" = "Group has been deleted";
"mx_web_load_fail" = "Load Failure";
"mx_group_selected_room" = "Select a room (used to manage group locations)";
"mx_scene_action_below" = "Execute following tasks";
"mx_scene_color_set" = "Color";
"mx_scene_brightness_set" = "Bright";
"mx_scene_switch_set" = "On/Off";
"mx_scene_temperature_set" = "ColorTemp";
"mx_week_four" = "Thu";
"mx_week_two" = "Tue";
"mx_week_five" = "Fir";
"mx_week_six" = "Sat";
"mx_week_one" = "Mon";
"mx_week_three" = "Wed";
"mx_week_seven" = "Sun";
"mx_scene_open_selected_device" = "Click to open the selected devices";
"mx_scene_temperature_input_hint" = "Please enter the color temperature";
"mx_scene_rgb_input_hint" = "Please enter the color RGB value";
"mx_intelligence_create" = "Create Smart";
"mx_scene_selected_on" = "Click to open the selected scene";
"mx_scene_selected_switch_hint" = "Please select the switch function";
"mx_ble_disconnect_title" = "Tips:";
"mx_ble_disconnect_reason" = "Fail to connect device by bluetooth:";
"mx_ble_disconnect_reason_des" = "1. The device fails or is not powered on; \n 2. The Bluetooth of the phone is not turned on, or it is authorized to use; \n 3.The phone is far away from the device, out of the signal range. Please try to keep within 10 meters; \n 4. The device has been connected by other phone, and each device can only be connected to one phone. As long as the phone is connected to one device, it can control all devices in the MESH network.";
"mx_ble_disconnect_hint" = "Please check the  Bluetooth connection status";
"mx_scene_close_selected_scene" = "Click to close  the selected scenes";
"mx_scene_close_selected_device" = "Click to close the selected devices";
"mx_tool" = "Tools";
"mx_sync_fail_detail_title" = "Try the following possible solutions:";
"mx_sync_fail_detail_des" = "1. Power off and restart the device; \n2. Restart the Bluetooth of the phone; \n3. Add the  failed devices again;";
"mx_light_zoom_des" = "Please zoom the viewfinder to align with the picture";
"mx_light_num_select" = "LED Qty";
"mx_trigger_timer" = "Trigger Time";
"mx_scene_trigger_title_and" = "When all conditions are met";
"mx_del_auto" = "Delete Auto Scene";
"mx_scene_method_cloud" = "Cloud";
"mx_scene_method_local" = "Local";
"mx_personal" = "My";
"mx_livingroom" = "Living room";
"mx_bedroom" = "Bedroom";
"mx_kitchen" = "Kitchen";
"mx_server_error" = "Server error";
"mx_scan_auth" = "Please allow access to your camera under Settings - Privacy - Camera";
"mx_scan_light_off" = "Touch off";
"mx_scan_light_on" = "Touch light";
"mx_default_country" = "China";
"mx_camera_auth_des" = "Please allow your access in the \"Settings - %@\" option";
"mx_room_move_group_des" = "The group has been added to \"%@\", Move to the Room?";
"mx_room_move_scene_des" = "The scene has been added to \"%@\", Move to the Room?";
"mx_room_move_auto_des" = "The auto has been added to \"%@\", Move to the Room?";
"mx_room_device_in" = "Device in this room";
"mx_room_group_in" = "Group in this room";
"mx_room_group_out" = "Group not in this room";
"mx_room_scene_in" = "Scene in this room";
"mx_room_scene_out" = "Scene not in this room";
"mx_room_auto_in" = "Auto in this room";
"mx_room_auto_out" = "Auto not in this room";
"mx_verification_code_hint" = "We have sent a verification code to %@. Please enter the verification code within 10 minutes.";
"mx_failed" = "failed";
"mx_scene_action_manual_title" = "Execute scene";
"mx_time_delay_value_des" = "After %02d min and %02d sec";
"mx_hour" = "h";
"mx_scene_timing_add" = "Add Timer";
"mx_scene_method_gateway" = "Gateway";
"mx_replace_device_des" = "Note:\n1. During synchronization, please keep the new device in the initialization state\n2. Please keep your mobile network connected during synchronization\n3. Please keep Bluetooth on during synchronization\n4. During synchronization, the mobile phone should be as close to the replacement device as possible\n5. After the synchronization is successful, the replaced device will be unbound";
"mx_scene_trigger_add_duration" = "Add Duration";
"mx_scene_trigger_delete_duration" = "Delete Duration";
"mx_scene_trigger_duration" = "Duration:";
"mx_scene_action_unrecognized" = "Unrecognized";
"mx_manual_control" = "Manual Control";
"mx_auto_control" = "Auto Control";
"mx_scene_room" = "Room";
"mx_share_device" = "Share";
"mx_whole_house_show" = "Show Home";
"mx_whole_house_hide" = "Hide Home";
"mx_nobody" = "Nobody";
"mx_somebody" = "Presence";
"mx_ble_disconnect_text" = "Mobile Bluetooth not connected to device, unable to synchronize settings";
"mx_whole_house_temperature_header_title" = "Please select the temperature detection device installed in the room";
"mx_whole_house_temperature_header_des" = "Support temperature and humidity sensors, temperature controllers";
"mx_whole_house_humidity_header_title" = "Please select the humidity detection equipment installed in the room";
"mx_whole_house_humidity_header_des" = "Support temperature and humidity sensors";
"mx_whole_house_occupancy_header_title" = "Please select the human presence detection device installed in the room";
"mx_whole_house_occupancy_header_des" = "Support the presence of sensors in the human body";
"mx_whole_house_pm_header_title" = "Please select the PM2.5 detection device installed in the room";
"mx_whole_house_pm_header_des" = "Support air purification equipment";
"mx_device_alarm" = "Device Alarm";
"mx_hide" = "Hidden";
"mx_title_select" = "Select";
"mx_no_group" = "No group";
"mx_no_scene" = "No scene";
"mx_no_auto" = "No auto";
"mx_del_group_des" = "Delete groups?";
"mx_whole_house_temperature" = "Temperature detection";
"mx_whole_house_humidity" = "Humidity detection";
"mx_whole_house_pm" = "PM2.5 detection";
"mx_whole_house_occupancy" = "Occupancy detection";
"mx_scenes_and_autos" = "Scenes and Autos";
"mx_gateway_work_mode" = "Gateway Work Mode";
"mx_gateway_setting" = "Gateway Settings";
"mx_gateway_work_mode_ethernet" = "Using Ethernet";
"mx_gateway_work_mode_wifi" = "Using Wi-Fi";
"mx_device_create_group" = "Create Group";
"mx_gateway_manage" = "Gateway Manage";
"mx_gateway_list_no_data" = "No Gateway";
"mx_gateway_manage_header_title" = "Please select the main gateway within the household";
"mx_my_device_no_data" = "No device can be shared";
"mx_homes_search_hint" = "Please enter the home name";
"mx_devices_search_hint" = "Please enter the device name";
"mx_groups_search_hint" = "Please enter the group name";
"mx_scenes_search_hint" = "Please enter the scene name";
"mx_autos_search_hint" = "Please enter the automation name";
"mx_group_name_invalid" = "Group name only supports 1-15 characters";
"mx_app_agreement_title" = "User Agreement and Privacy Policy";
"mx_agreement_dialog_txt" = "Please read and agree to the %@ and %@ carefully before using the Services. The Agreement contains special provisions regarding your rights and obligations and other important terms, which we remind you of in bold and underlined. If you have any questions while reading the Agreement, please contact Customer Service.";
"mx_account_agreement" = "I have read and agreed to the %@ and %@";
"mx_login" = "Login";
"mx_password" = "Password";
"mx_search" = "Search";
"mx_no_message" = "No Message";

"mx_scene_action_copy_title" = "Copy Smart Execution Action";
"mx_scene_action_copy_des" = "eg: Copy the execution actions of \"Viewing Mode\"";
"mx_auto_select" = "Select Auto Scene";

"mx_show_hide" = "Hide";
"mx_show" = "Show";

"mx_sync_fail_detail_des_gateway" = "1. Power off and restart the device; \n2. If the gateway is set to \"Connect to server room\", \n please connect your cell phone and the gateway to the same LAN;";

"mx_chatbot" = "Chatbot";
"mx_chat_input_hint" = "Please input...";
"mx_chat_recommend_title" = "You might want to ask";
"mx_chat_wake_up" = "Hello, I am your smart assistant. How can I help you ?";

"mx_chat_suggestion_1" = "Can't find the device on the app?";
"mx_chat_suggestion_2" = "Can't add device successfully?";
"mx_chat_suggestion_3" = "What should I do if the device addition fails?";
"mx_chat_suggestion_4" = "Why does the scene always fail to synchronize?";

"mx_chat_request_error" = "Server is busy ,please try again latter.";

"mx_submit_info" = "Loading";

"mx_shortcut" = "Shortcut";
"mx_shortcut_delete" = "Delete Shortcut";
"mx_del_shortcut_des" = "Delete this shortcut? Deletion will not affect proper usage of actual device";

"mx_auto_gateway" = "Gateway Auto Scene";
"mx_auto_gateway_des" = "Scenes triggered by the local MESH device when there is a gateway, e.g. turn on all lights of living room regularly every day";
"mx_auto_local" = "Local Auto Scene";
"mx_auto_local_des" = "Scenes triggered by the local MESH device when there is no network, e.g. Switch on the light when you open the door";
"mx_auto_cloud" = "Cloud Auto Scene";
"mx_auto_cloud_des" = "Remote, timer, weather-triggered scenes, e.g. Switch on the living room lights at 7pm";

"mx_qrcode_invalid" = "Invalid QR code";

"mx_wechat_install_hint" = "WeChat is not installed";

"mx_account_safe" = "Account and Security";
"mx_permission_manager" = "System Permission";

"mx_permission_bluetooth" = "Bluetooth";
"mx_permission_camera" = "Camera";
"mx_permission_picture" = "Album";
"mx_permission_location" = "Location";
"mx_permission_bluetooth_des" = "Used for transmitting data between the app and your device during network connecting, discovering and controlling nearby devices.";
"mx_permission_camera_des" = "Used for scanning QR codes to share the family and taking profile pictures";
"mx_permission_picture_des" = "Used for reading and saving profile images.";
"mx_permission_location_des" = "Used for scanning nearby WiFi networks, identifying regional environmental information, and setting the time zone, etc.";
"mx_permission_allowed" = "Allowed";
"mx_permission_set" = "Set";

"mx_third_account" = "Third-Party Account";
"mx_wechat" = "Wechat";
"mx_alipay" = "Alipay";
"mx_apple" = "Apple ID";
"mx_thrid_account_unbund_title" = "Are you sure to unbind?";
"mx_thrid_account_unbund_content" = "If the %s is unbound,you cannot use it to login";
"mx_bound" = "Bind now";
"mx_unbound" = "Unbind";

"mx_product_manual" = "Product Manual";

"mx_environment_switch" = "Environment Switch";
"mx_environment_select" = "Environment Select";
"mx_environment_test" = "Test";
"mx_environment_pre" = "Pre";
"mx_environment_release" = "Release";

"mx_product_key" = "Product ID";
"mx_mac" = "Mac";
